tutorial/case/system/alphaMeanFO
alphaMeanFO
{
    type            volFieldValue;
    functionObjectLibs ("libfieldFunctionObjects.so");
    fields          (alpha.electrolyte);
    operation       average;
    writeControl    timeStep;
    writeInterval   1;
    writeFields     no;
}

