tutorial/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
i| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0     0       0      ) // 0
    (10    0       0      ) // 1
    (10    0       1   ) // 2
    (0     0       1   ) // 3

    (0     10      0      ) // 4
    (10    10      0      ) // 5
    (10    10      1   ) // 6
    (0     10      1   ) // 7

    (0     170     0      ) // 8
    (10    170     0      ) // 9
    (10    170     1   ) // 10
    (0     170     1   ) // 11
);

blocks
(
    hex (0 1 5 4 3 2 6 7) (20 20 1) simpleGrading (1 1 1) //bottom
    hex (4 5 9 8 7 6 10 11) (20 320 1) simpleGrading (1 1 1) //top
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)     // bottom face
            //(0 4 5 1)     // front
            (1 5 6 2)     // right
            //(2 6 7 3)     // back
            (3 7 4 0)     // left
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    walls
    {
        type wall;
        faces
        (
            //(4 8 9 5) //back
            (5 9 10 6) //right
            //(6 10 11 7) //front
            (7 11 8 4) //left
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1) //inlet
            (2 6 7 3) //inlet
            (6 10 11 7)
            (4 8 9 5)
        );
    }
);

mergePatchPairs ();



// ************************************************************************* //


